Paciente8159/uCNC/uCNC/src/hal/mcus/esp32c3/mcumap_esp32c3.h
/*
        Name: mcumap_esp32_c.h
        Description: Contains all MCU and PIN definitions for Arduino ESP32-Cx
   to run µCNC.

        Copyright: Copyright (c) João Martins
        Author: João Martins
        Date: 10-03-2025

        µCNC is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation, either version 3 of the License, or
        (at your option) any later version. Please see
   <http://www.gnu.org/licenses/>

        µCNC is distributed WITHOUT ANY WARRANTY;
        Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the	GNU General Public License for more details.
*/

#ifndef MCUMAP_ESP32C3_H
#define MCUMAP_ESP32C3_H

#ifdef __cplusplus
extern "C" {
#endif

#include "driver/adc.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "driver/timer.h"
#include "hal/gpio_ll.h"
#include <Arduino.h>

/*
        Generates all the interface definitions.
        This creates a middle HAL layer between the board IO pins and the AVR
   funtionalities
*/
/*
        MCU specific definitions and replacements
*/

/*
        ESP32-C Defaults
*/
// defines the frequency of the mcu
#ifndef F_CPU
#define F_CPU 160000000L
#endif
// defines the maximum and minimum step rates
#ifndef F_STEP_MAX
#define F_STEP_MAX 125000UL
#endif
#ifndef F_STEP_MIN
#define F_STEP_MIN 1
#endif

#define FORCE_HAL_IO_DIRECTION_ONREQUEST

#ifndef USE_CUSTOM_EEPROM_LIBRARY
#ifndef USE_ARDUINO_EEPROM_LIBRARY
#define USE_ARDUINO_EEPROM_LIBRARY
#endif
#endif

// defines special mcu to access flash strings and arrays
#define __rom__
#define __romstr__
#define rom_strptr *
#define rom_strcpy strcpy
#define rom_strncpy strncpy
#define rom_memcpy memcpy
#define rom_read_byte *

#define ATOMIC_CODEBLOCK
#define ATOMIC_CODEBLOCK_NR
#define mcu_disable_global_isr ets_intr_lock
#define mcu_enable_global_isr ets_intr_unlock

// needed by software delays
#ifndef MCU_CYCLES_PER_LOOP
#define MCU_CYCLES_PER_LOOP 6
#endif
#ifndef MCU_CYCLES_LOOP_OVERHEAD
#define MCU_CYCLES_LOOP_OVERHEAD 3
#endif

#define mcu_delay_loop(X)                                                      \
  do {                                                                         \
    register unsigned start, now,                                              \
        target = (((X) - 1) * MCU_CYCLES_PER_LOOP + 2);                        \
    asm volatile("" ::: "memory");                                             \
    asm volatile("rdcycle %0\n"           /* start = cycle counter */          \
                 "1: rdcycle %1\n"        /* now = cycle counter */            \
                 "   sub    %1, %1, %0\n" /* tmp = now - start */              \
                 "   bltu   %1, %2, 1b\n" /* loop until tmp >= target */       \
                 "   nop\n"                                                    \
                 : "=&r"(start), "=&r"(now)                                    \
                 : "r"(target));                                               \
  } while (0)

#ifndef MCU_CALLBACK
#define MCU_CALLBACK IRAM_ATTR
#endif

#ifdef ENABLE_RX_SYNC
#define MCU_RX_CALLBACK ICACHE_FLASH_ATTR
#endif

#ifdef ENABLE_TX_SYNC
#define MCU_TX_CALLBACK ICACHE_FLASH_ATTR
#endif

#define MCU_IO_CALLBACK ICACHE_FLASH_ATTR

#ifdef RX_BUFFER_CAPACITY
#define RX_BUFFER_CAPACITY 255
#endif

#define __SIZEOF_FLOAT__ 4

// used by the parser
// this method is faster then normal multiplication (for 32 bit for 16 and 8
// bits is slightly lower) overrides utils.h definition to implement this method
// with or without fast math option enabled
#define fast_int_mul10(x) ((((x) << 2) + (x)) << 1)

// PINNAMES for ESP32
#define PERIPHS_IO_MUX_GPIO0 (PERIPHS_IO_MUX + 0x34)
#define PERIPHS_IO_MUX_GPIO1 (PERIPHS_IO_MUX + 0x18)
#define PERIPHS_IO_MUX_GPIO2 (PERIPHS_IO_MUX + 0x38)
#define PERIPHS_IO_MUX_GPIO3 (PERIPHS_IO_MUX + 0x14)
#define PERIPHS_IO_MUX_GPIO4 (PERIPHS_IO_MUX + 0x3C)
#define PERIPHS_IO_MUX_GPIO5 (PERIPHS_IO_MUX + 0x40)
#define PERIPHS_IO_MUX_GPIO6 (PERIPHS_IO_MUX + 0x1c)
#define PERIPHS_IO_MUX_GPIO7 (PERIPHS_IO_MUX + 0x20)
#define PERIPHS_IO_MUX_GPIO8 (PERIPHS_IO_MUX + 0x24)
#define PERIPHS_IO_MUX_GPIO9 (PERIPHS_IO_MUX + 0x28)
#define PERIPHS_IO_MUX_GPIO10 (PERIPHS_IO_MUX + 0x2c)
#define PERIPHS_IO_MUX_GPIO11 (PERIPHS_IO_MUX + 0x30)
#define PERIPHS_IO_MUX_GPIO12 (PERIPHS_IO_MUX + 0x04)
#define PERIPHS_IO_MUX_GPIO13 (PERIPHS_IO_MUX + 0x08)
#define PERIPHS_IO_MUX_GPIO14 (PERIPHS_IO_MUX + 0x0C)
#define PERIPHS_IO_MUX_GPIO15 (PERIPHS_IO_MUX + 0x10)

typedef struct {
  volatile uint32_t OUT;
  volatile uint32_t OUTSET;
  volatile uint32_t OUTCLR;
} IO_OUT_TypeDef;

typedef struct {
  volatile uint32_t IN;
} IO_IN_TypeDef;

#define OUT0 ((IO_OUT_TypeDef *)GPIO_OUT_REG)
#ifdef GPIO_OUT1_REG
#define OUT1 ((IO_OUT_TypeDef *)GPIO_OUT1_REG)
#endif

#define IN0 ((IO_IN_TypeDef *)GPIO_IN_REG)
#ifdef GPIO_IN1_REG
#define IN1 ((IO_IN_TypeDef *)GPIO_IN1_REG)
#endif

// IO pins
#if (defined(STEP0_BIT))
#define STEP0 1
#if (STEP0_BIT < 32)
#define STEP0_OUTREG OUT0
#define STEP0_INREG IN0
#else
#define STEP0_OUTREG OUT1
#define STEP0_INREG IN1
#endif
#define DIO1 1
#define DIO1_BIT STEP0_BIT
#define DIO1_OUTREG STEP0_OUTREG
#define DIO1_INREG STEP0_INREG
#endif
#if (defined(STEP1_BIT))
#define STEP1 2
#if (STEP1_BIT < 32)
#define STEP1_OUTREG OUT0
#define STEP1_INREG IN0
#else
#define STEP1_OUTREG OUT1
#define STEP1_INREG IN1
#endif
#define DIO2 2
#define DIO2_BIT STEP1_BIT
#define DIO2_OUTREG STEP1_OUTREG
#define DIO2_INREG STEP1_INREG
#endif
#if (defined(STEP2_BIT))
#define STEP2 3
#if (STEP2_BIT < 32)
#define STEP2_OUTREG OUT0
#define STEP2_INREG IN0
#else
#define STEP2_OUTREG OUT1
#define STEP2_INREG IN1
#endif
#define DIO3 3
#define DIO3_BIT STEP2_BIT
#define DIO3_OUTREG STEP2_OUTREG
#define DIO3_INREG STEP2_INREG
#endif
#if (defined(STEP3_BIT))
#define STEP3 4
#if (STEP3_BIT < 32)
#define STEP3_OUTREG OUT0
#define STEP3_INREG IN0
#else
#define STEP3_OUTREG OUT1
#define STEP3_INREG IN1
#endif
#define DIO4 4
#define DIO4_BIT STEP3_BIT
#define DIO4_OUTREG STEP3_OUTREG
#define DIO4_INREG STEP3_INREG
#endif
#if (defined(STEP4_BIT))
#define STEP4 5
#if (STEP4_BIT < 32)
#define STEP4_OUTREG OUT0
#define STEP4_INREG IN0
#else
#define STEP4_OUTREG OUT1
#define STEP4_INREG IN1
#endif
#define DIO5 5
#define DIO5_BIT STEP4_BIT
#define DIO5_OUTREG STEP4_OUTREG
#define DIO5_INREG STEP4_INREG
#endif
#if (defined(STEP5_BIT))
#define STEP5 6
#if (STEP5_BIT < 32)
#define STEP5_OUTREG OUT0
#define STEP5_INREG IN0
#else
#define STEP5_OUTREG OUT1
#define STEP5_INREG IN1
#endif
#define DIO6 6
#define DIO6_BIT STEP5_BIT
#define DIO6_OUTREG STEP5_OUTREG
#define DIO6_INREG STEP5_INREG
#endif
#if (defined(STEP6_BIT))
#define STEP6 7
#if (STEP6_BIT < 32)
#define STEP6_OUTREG OUT0
#define STEP6_INREG IN0
#else
#define STEP6_OUTREG OUT1
#define STEP6_INREG IN1
#endif
#define DIO7 7
#define DIO7_BIT STEP6_BIT
#define DIO7_OUTREG STEP6_OUTREG
#define DIO7_INREG STEP6_INREG
#endif
#if (defined(STEP7_BIT))
#define STEP7 8
#if (STEP7_BIT < 32)
#define STEP7_OUTREG OUT0
#define STEP7_INREG IN0
#else
#define STEP7_OUTREG OUT1
#define STEP7_INREG IN1
#endif
#define DIO8 8
#define DIO8_BIT STEP7_BIT
#define DIO8_OUTREG STEP7_OUTREG
#define DIO8_INREG STEP7_INREG
#endif
#if (defined(DIR0_BIT))
#define DIR0 9
#if (DIR0_BIT < 32)
#define DIR0_OUTREG OUT0
#define DIR0_INREG IN0
#else
#define DIR0_OUTREG OUT1
#define DIR0_INREG IN1
#endif
#define DIO9 9
#define DIO9_BIT DIR0_BIT
#define DIO9_OUTREG DIR0_OUTREG
#define DIO9_INREG DIR0_INREG
#endif
#if (defined(DIR1_BIT))
#define DIR1 10
#if (DIR1_BIT < 32)
#define DIR1_OUTREG OUT0
#define DIR1_INREG IN0
#else
#define DIR1_OUTREG OUT1
#define DIR1_INREG IN1
#endif
#define DIO10 10
#define DIO10_BIT DIR1_BIT
#define DIO10_OUTREG DIR1_OUTREG
#define DIO10_INREG DIR1_INREG
#endif
#if (defined(DIR2_BIT))
#define DIR2 11
#if (DIR2_BIT < 32)
#define DIR2_OUTREG OUT0
#define DIR2_INREG IN0
#else
#define DIR2_OUTREG OUT1
#define DIR2_INREG IN1
#endif
#define DIO11 11
#define DIO11_BIT DIR2_BIT
#define DIO11_OUTREG DIR2_OUTREG
#define DIO11_INREG DIR2_INREG
#endif
#if (defined(DIR3_BIT))
#define DIR3 12
#if (DIR3_BIT < 32)
#define DIR3_OUTREG OUT0
#define DIR3_INREG IN0
#else
#define DIR3_OUTREG OUT1
#define DIR3_INREG IN1
#endif
#define DIO12 12
#define DIO12_BIT DIR3_BIT
#define DIO12_OUTREG DIR3_OUTREG
#define DIO12_INREG DIR3_INREG
#endif
#if (defined(DIR4_BIT))
#define DIR4 13
#if (DIR4_BIT < 32)
#define DIR4_OUTREG OUT0
#define DIR4_INREG IN0
#else
#define DIR4_OUTREG OUT1
#define DIR4_INREG IN1
#endif
#define DIO13 13
#define DIO13_BIT DIR4_BIT
#define DIO13_OUTREG DIR4_OUTREG
#define DIO13_INREG DIR4_INREG
#endif
#if (defined(DIR5_BIT))
#define DIR5 14
#if (DIR5_BIT < 32)
#define DIR5_OUTREG OUT0
#define DIR5_INREG IN0
#else
#define DIR5_OUTREG OUT1
#define DIR5_INREG IN1
#endif
#define DIO14 14
#define DIO14_BIT DIR5_BIT
#define DIO14_OUTREG DIR5_OUTREG
#define DIO14_INREG DIR5_INREG
#endif
#if (defined(DIR6_BIT))
#define DIR6 15
#if (DIR6_BIT < 32)
#define DIR6_OUTREG OUT0
#define DIR6_INREG IN0
#else
#define DIR6_OUTREG OUT1
#define DIR6_INREG IN1
#endif
#define DIO15 15
#define DIO15_BIT DIR6_BIT
#define DIO15_OUTREG DIR6_OUTREG
#define DIO15_INREG DIR6_INREG
#endif
#if (defined(DIR7_BIT))
#define DIR7 16
#if (DIR7_BIT < 32)
#define DIR7_OUTREG OUT0
#define DIR7_INREG IN0
#else
#define DIR7_OUTREG OUT1
#define DIR7_INREG IN1
#endif
#define DIO16 16
#define DIO16_BIT DIR7_BIT
#define DIO16_OUTREG DIR7_OUTREG
#define DIO16_INREG DIR7_INREG
#endif
#if (defined(STEP0_EN_BIT))
#define STEP0_EN 17
#if (STEP0_EN_BIT < 32)
#define STEP0_EN_OUTREG OUT0
#define STEP0_EN_INREG IN0
#else
#define STEP0_EN_OUTREG OUT1
#define STEP0_EN_INREG IN1
#endif
#define DIO17 17
#define DIO17_BIT STEP0_EN_BIT
#define DIO17_OUTREG STEP0_EN_OUTREG
#define DIO17_INREG STEP0_EN_INREG
#endif
#if (defined(STEP1_EN_BIT))
#define STEP1_EN 18
#if (STEP1_EN_BIT < 32)
#define STEP1_EN_OUTREG OUT0
#define STEP1_EN_INREG IN0
#else
#define STEP1_EN_OUTREG OUT1
#define STEP1_EN_INREG IN1
#endif
#define DIO18 18
#define DIO18_BIT STEP1_EN_BIT
#define DIO18_OUTREG STEP1_EN_OUTREG
#define DIO18_INREG STEP1_EN_INREG
#endif
#if (defined(STEP2_EN_BIT))
#define STEP2_EN 19
#if (STEP2_EN_BIT < 32)
#define STEP2_EN_OUTREG OUT0
#define STEP2_EN_INREG IN0
#else
#define STEP2_EN_OUTREG OUT1
#define STEP2_EN_INREG IN1
#endif
#define DIO19 19
#define DIO19_BIT STEP2_EN_BIT
#define DIO19_OUTREG STEP2_EN_OUTREG
#define DIO19_INREG STEP2_EN_INREG
#endif
#if (defined(STEP3_EN_BIT))
#define STEP3_EN 20
#if (STEP3_EN_BIT < 32)
#define STEP3_EN_OUTREG OUT0
#define STEP3_EN_INREG IN0
#else
#define STEP3_EN_OUTREG OUT1
#define STEP3_EN_INREG IN1
#endif
#define DIO20 20
#define DIO20_BIT STEP3_EN_BIT
#define DIO20_OUTREG STEP3_EN_OUTREG
#define DIO20_INREG STEP3_EN_INREG
#endif
#if (defined(STEP4_EN_BIT))
#define STEP4_EN 21
#if (STEP4_EN_BIT < 32)
#define STEP4_EN_OUTREG OUT0
#define STEP4_EN_INREG IN0
#else
#define STEP4_EN_OUTREG OUT1
#define STEP4_EN_INREG IN1
#endif
#define DIO21 21
#define DIO21_BIT STEP4_EN_BIT
#define DIO21_OUTREG STEP4_EN_OUTREG
#define DIO21_INREG STEP4_EN_INREG
#endif
#if (defined(STEP5_EN_BIT))
#define STEP5_EN 22
#if (STEP5_EN_BIT < 32)
#define STEP5_EN_OUTREG OUT0
#define STEP5_EN_INREG IN0
#else
#define STEP5_EN_OUTREG OUT1
#define STEP5_EN_INREG IN1
#endif
#define DIO22 22
#define DIO22_BIT STEP5_EN_BIT
#define DIO22_OUTREG STEP5_EN_OUTREG
#define DIO22_INREG STEP5_EN_INREG
#endif
#if (defined(STEP6_EN_BIT))
#define STEP6_EN 23
#if (STEP6_EN_BIT < 32)
#define STEP6_EN_OUTREG OUT0
#define STEP6_EN_INREG IN0
#else
#define STEP6_EN_OUTREG OUT1
#define STEP6_EN_INREG IN1
#endif
#define DIO23 23
#define DIO23_BIT STEP6_EN_BIT
#define DIO23_OUTREG STEP6_EN_OUTREG
#define DIO23_INREG STEP6_EN_INREG
#endif
#if (defined(STEP7_EN_BIT))
#define STEP7_EN 24
#if (STEP7_EN_BIT < 32)
#define STEP7_EN_OUTREG OUT0
#define STEP7_EN_INREG IN0
#else
#define STEP7_EN_OUTREG OUT1
#define STEP7_EN_INREG IN1
#endif
#define DIO24 24
#define DIO24_BIT STEP7_EN_BIT
#define DIO24_OUTREG STEP7_EN_OUTREG
#define DIO24_INREG STEP7_EN_INREG
#endif
#if (defined(PWM0_BIT))
#define PWM0 25
#if (PWM0_BIT < 32)
#define PWM0_OUTREG OUT0
#define PWM0_INREG IN0
#else
#define PWM0_OUTREG OUT1
#define PWM0_INREG IN1
#endif
#define DIO25 25
#define DIO25_BIT PWM0_BIT
#define DIO25_OUTREG PWM0_OUTREG
#define DIO25_INREG PWM0_INREG
#endif
#if (defined(PWM1_BIT))
#define PWM1 26
#if (PWM1_BIT < 32)
#define PWM1_OUTREG OUT0
#define PWM1_INREG IN0
#else
#define PWM1_OUTREG OUT1
#define PWM1_INREG IN1
#endif
#define DIO26 26
#define DIO26_BIT PWM1_BIT
#define DIO26_OUTREG PWM1_OUTREG
#define DIO26_INREG PWM1_INREG
#endif
#if (defined(PWM2_BIT))
#define PWM2 27
#if (PWM2_BIT < 32)
#define PWM2_OUTREG OUT0
#define PWM2_INREG IN0
#else
#define PWM2_OUTREG OUT1
#define PWM2_INREG IN1
#endif
#define DIO27 27
#define DIO27_BIT PWM2_BIT
#define DIO27_OUTREG PWM2_OUTREG
#define DIO27_INREG PWM2_INREG
#endif
#if (defined(PWM3_BIT))
#define PWM3 28
#if (PWM3_BIT < 32)
#define PWM3_OUTREG OUT0
#define PWM3_INREG IN0
#else
#define PWM3_OUTREG OUT1
#define PWM3_INREG IN1
#endif
#define DIO28 28
#define DIO28_BIT PWM3_BIT
#define DIO28_OUTREG PWM3_OUTREG
#define DIO28_INREG PWM3_INREG
#endif
#if (defined(PWM4_BIT))
#define PWM4 29
#if (PWM4_BIT < 32)
#define PWM4_OUTREG OUT0
#define PWM4_INREG IN0
#else
#define PWM4_OUTREG OUT1
#define PWM4_INREG IN1
#endif
#define DIO29 29
#define DIO29_BIT PWM4_BIT
#define DIO29_OUTREG PWM4_OUTREG
#define DIO29_INREG PWM4_INREG
#endif
#if (defined(PWM5_BIT))
#define PWM5 30
#if (PWM5_BIT < 32)
#define PWM5_OUTREG OUT0
#define PWM5_INREG IN0
#else
#define PWM5_OUTREG OUT1
#define PWM5_INREG IN1
#endif
#define DIO30 30
#define DIO30_BIT PWM5_BIT
#define DIO30_OUTREG PWM5_OUTREG
#define DIO30_INREG PWM5_INREG
#endif
#if (defined(PWM6_BIT))
#define PWM6 31
#if (PWM6_BIT < 32)
#define PWM6_OUTREG OUT0
#define PWM6_INREG IN0
#else
#define PWM6_OUTREG OUT1
#define PWM6_INREG IN1
#endif
#define DIO31 31
#define DIO31_BIT PWM6_BIT
#define DIO31_OUTREG PWM6_OUTREG
#define DIO31_INREG PWM6_INREG
#endif
#if (defined(PWM7_BIT))
#define PWM7 32
#if (PWM7_BIT < 32)
#define PWM7_OUTREG OUT0
#define PWM7_INREG IN0
#else
#define PWM7_OUTREG OUT1
#define PWM7_INREG IN1
#endif
#define DIO32 32
#define DIO32_BIT PWM7_BIT
#define DIO32_OUTREG PWM7_OUTREG
#define DIO32_INREG PWM7_INREG
#endif
#if (defined(PWM8_BIT))
#define PWM8 33
#if (PWM8_BIT < 32)
#define PWM8_OUTREG OUT0
#define PWM8_INREG IN0
#else
#define PWM8_OUTREG OUT1
#define PWM8_INREG IN1
#endif
#define DIO33 33
#define DIO33_BIT PWM8_BIT
#define DIO33_OUTREG PWM8_OUTREG
#define DIO33_INREG PWM8_INREG
#endif
#if (defined(PWM9_BIT))
#define PWM9 34
#if (PWM9_BIT < 32)
#define PWM9_OUTREG OUT0
#define PWM9_INREG IN0
#else
#define PWM9_OUTREG OUT1
#define PWM9_INREG IN1
#endif
#define DIO34 34
#define DIO34_BIT PWM9_BIT
#define DIO34_OUTREG PWM9_OUTREG
#define DIO34_INREG PWM9_INREG
#endif
#if (defined(PWM10_BIT))
#define PWM10 35
#if (PWM10_BIT < 32)
#define PWM10_OUTREG OUT0
#define PWM10_INREG IN0
#else
#define PWM10_OUTREG OUT1
#define PWM10_INREG IN1
#endif
#define DIO35 35
#define DIO35_BIT PWM10_BIT
#define DIO35_OUTREG PWM10_OUTREG
#define DIO35_INREG PWM10_INREG
#endif
#if (defined(PWM11_BIT))
#define PWM11 36
#if (PWM11_BIT < 32)
#define PWM11_OUTREG OUT0
#define PWM11_INREG IN0
#else
#define PWM11_OUTREG OUT1
#define PWM11_INREG IN1
#endif
#define DIO36 36
#define DIO36_BIT PWM11_BIT
#define DIO36_OUTREG PWM11_OUTREG
#define DIO36_INREG PWM11_INREG
#endif
#if (defined(PWM12_BIT))
#define PWM12 37
#if (PWM12_BIT < 32)
#define PWM12_OUTREG OUT0
#define PWM12_INREG IN0
#else
#define PWM12_OUTREG OUT1
#define PWM12_INREG IN1
#endif
#define DIO37 37
#define DIO37_BIT PWM12_BIT
#define DIO37_OUTREG PWM12_OUTREG
#define DIO37_INREG PWM12_INREG
#endif
#if (defined(PWM13_BIT))
#define PWM13 38
#if (PWM13_BIT < 32)
#define PWM13_OUTREG OUT0
#define PWM13_INREG IN0
#else
#define PWM13_OUTREG OUT1
#define PWM13_INREG IN1
#endif
#define DIO38 38
#define DIO38_BIT PWM13_BIT
#define DIO38_OUTREG PWM13_OUTREG
#define DIO38_INREG PWM13_INREG
#endif
#if (defined(PWM14_BIT))
#define PWM14 39
#if (PWM14_BIT < 32)
#define PWM14_OUTREG OUT0
#define PWM14_INREG IN0
#else
#define PWM14_OUTREG OUT1
#define PWM14_INREG IN1
#endif
#define DIO39 39
#define DIO39_BIT PWM14_BIT
#define DIO39_OUTREG PWM14_OUTREG
#define DIO39_INREG PWM14_INREG
#endif
#if (defined(PWM15_BIT))
#define PWM15 40
#if (PWM15_BIT < 32)
#define PWM15_OUTREG OUT0
#define PWM15_INREG IN0
#else
#define PWM15_OUTREG OUT1
#define PWM15_INREG IN1
#endif
#define DIO40 40
#define DIO40_BIT PWM15_BIT
#define DIO40_OUTREG PWM15_OUTREG
#define DIO40_INREG PWM15_INREG
#endif
#if (defined(SERVO0_BIT))
#define SERVO0 41
#if (SERVO0_BIT < 32)
#define SERVO0_OUTREG OUT0
#define SERVO0_INREG IN0
#else
#define SERVO0_OUTREG OUT1
#define SERVO0_INREG IN1
#endif
#define DIO41 41
#define DIO41_BIT SERVO0_BIT
#define DIO41_OUTREG SERVO0_OUTREG
#define DIO41_INREG SERVO0_INREG
#endif
#if (defined(SERVO1_BIT))
#define SERVO1 42
#if (SERVO1_BIT < 32)
#define SERVO1_OUTREG OUT0
#define SERVO1_INREG IN0
#else
#define SERVO1_OUTREG OUT1
#define SERVO1_INREG IN1
#endif
#define DIO42 42
#define DIO42_BIT SERVO1_BIT
#define DIO42_OUTREG SERVO1_OUTREG
#define DIO42_INREG SERVO1_INREG
#endif
#if (defined(SERVO2_BIT))
#define SERVO2 43
#if (SERVO2_BIT < 32)
#define SERVO2_OUTREG OUT0
#define SERVO2_INREG IN0
#else
#define SERVO2_OUTREG OUT1
#define SERVO2_INREG IN1
#endif
#define DIO43 43
#define DIO43_BIT SERVO2_BIT
#define DIO43_OUTREG SERVO2_OUTREG
#define DIO43_INREG SERVO2_INREG
#endif
#if (defined(SERVO3_BIT))
#define SERVO3 44
#if (SERVO3_BIT < 32)
#define SERVO3_OUTREG OUT0
#define SERVO3_INREG IN0
#else
#define SERVO3_OUTREG OUT1
#define SERVO3_INREG IN1
#endif
#define DIO44 44
#define DIO44_BIT SERVO3_BIT
#define DIO44_OUTREG SERVO3_OUTREG
#define DIO44_INREG SERVO3_INREG
#endif
#if (defined(SERVO4_BIT))
#define SERVO4 45
#if (SERVO4_BIT < 32)
#define SERVO4_OUTREG OUT0
#define SERVO4_INREG IN0
#else
#define SERVO4_OUTREG OUT1
#define SERVO4_INREG IN1
#endif
#define DIO45 45
#define DIO45_BIT SERVO4_BIT
#define DIO45_OUTREG SERVO4_OUTREG
#define DIO45_INREG SERVO4_INREG
#endif
#if (defined(SERVO5_BIT))
#define SERVO5 46
#if (SERVO5_BIT < 32)
#define SERVO5_OUTREG OUT0
#define SERVO5_INREG IN0
#else
#define SERVO5_OUTREG OUT1
#define SERVO5_INREG IN1
#endif
#define DIO46 46
#define DIO46_BIT SERVO5_BIT
#define DIO46_OUTREG SERVO5_OUTREG
#define DIO46_INREG SERVO5_INREG
#endif
#if (defined(DOUT0_BIT))
#define DOUT0 47
#if (DOUT0_BIT < 32)
#define DOUT0_OUTREG OUT0
#define DOUT0_INREG IN0
#else
#define DOUT0_OUTREG OUT1
#define DOUT0_INREG IN1
#endif
#define DIO47 47
#define DIO47_BIT DOUT0_BIT
#define DIO47_OUTREG DOUT0_OUTREG
#define DIO47_INREG DOUT0_INREG
#endif
#if (defined(DOUT1_BIT))
#define DOUT1 48
#if (DOUT1_BIT < 32)
#define DOUT1_OUTREG OUT0
#define DOUT1_INREG IN0
#else
#define DOUT1_OUTREG OUT1
#define DOUT1_INREG IN1
#endif
#define DIO48 48
#define DIO48_BIT DOUT1_BIT
#define DIO48_OUTREG DOUT1_OUTREG
#define DIO48_INREG DOUT1_INREG
#endif
#if (defined(DOUT2_BIT))
#define DOUT2 49
#if (DOUT2_BIT < 32)
#define DOUT2_OUTREG OUT0
#define DOUT2_INREG IN0
#else
#define DOUT2_OUTREG OUT1
#define DOUT2_INREG IN1
#endif
#define DIO49 49
#define DIO49_BIT DOUT2_BIT
#define DIO49_OUTREG DOUT2_OUTREG
#define DIO49_INREG DOUT2_INREG
#endif
#if (defined(DOUT3_BIT))
#define DOUT3 50
#if (DOUT3_BIT < 32)
#define DOUT3_OUTREG OUT0
#define DOUT3_INREG IN0
#else
#define DOUT3_OUTREG OUT1
#define DOUT3_INREG IN1
#endif
#define DIO50 50
#define DIO50_BIT DOUT3_BIT
#define DIO50_OUTREG DOUT3_OUTREG
#define DIO50_INREG DOUT3_INREG
#endif
#if (defined(DOUT4_BIT))
#define DOUT4 51
#if (DOUT4_BIT < 32)
#define DOUT4_OUTREG OUT0
#define DOUT4_INREG IN0
#else
#define DOUT4_OUTREG OUT1
#define DOUT4_INREG IN1
#endif
#define DIO51 51
#define DIO51_BIT DOUT4_BIT
#define DIO51_OUTREG DOUT4_OUTREG
#define DIO51_INREG DOUT4_INREG
#endif
#if (defined(DOUT5_BIT))
#define DOUT5 52
#if (DOUT5_BIT < 32)
#define DOUT5_OUTREG OUT0
#define DOUT5_INREG IN0
#else
#define DOUT5_OUTREG OUT1
#define DOUT5_INREG IN1
#endif
#define DIO52 52
#define DIO52_BIT DOUT5_BIT
#define DIO52_OUTREG DOUT5_OUTREG
#define DIO52_INREG DOUT5_INREG
#endif
#if (defined(DOUT6_BIT))
#define DOUT6 53
#if (DOUT6_BIT < 32)
#define DOUT6_OUTREG OUT0
#define DOUT6_INREG IN0
#else
#define DOUT6_OUTREG OUT1
#define DOUT6_INREG IN1
#endif
#define DIO53 53
#define DIO53_BIT DOUT6_BIT
#define DIO53_OUTREG DOUT6_OUTREG
#define DIO53_INREG DOUT6_INREG
#endif
#if (defined(DOUT7_BIT))
#define DOUT7 54
#if (DOUT7_BIT < 32)
#define DOUT7_OUTREG OUT0
#define DOUT7_INREG IN0
#else
#define DOUT7_OUTREG OUT1
#define DOUT7_INREG IN1
#endif
#define DIO54 54
#define DIO54_BIT DOUT7_BIT
#define DIO54_OUTREG DOUT7_OUTREG
#define DIO54_INREG DOUT7_INREG
#endif
#if (defined(DOUT8_BIT))
#define DOUT8 55
#if (DOUT8_BIT < 32)
#define DOUT8_OUTREG OUT0
#define DOUT8_INREG IN0
#else
#define DOUT8_OUTREG OUT1
#define DOUT8_INREG IN1
#endif
#define DIO55 55
#define DIO55_BIT DOUT8_BIT
#define DIO55_OUTREG DOUT8_OUTREG
#define DIO55_INREG DOUT8_INREG
#endif
#if (defined(DOUT9_BIT))
#define DOUT9 56
#if (DOUT9_BIT < 32)
#define DOUT9_OUTREG OUT0
#define DOUT9_INREG IN0
#else
#define DOUT9_OUTREG OUT1
#define DOUT9_INREG IN1
#endif
#define DIO56 56
#define DIO56_BIT DOUT9_BIT
#define DIO56_OUTREG DOUT9_OUTREG
#define DIO56_INREG DOUT9_INREG
#endif
#if (defined(DOUT10_BIT))
#define DOUT10 57
#if (DOUT10_BIT < 32)
#define DOUT10_OUTREG OUT0
#define DOUT10_INREG IN0
#else
#define DOUT10_OUTREG OUT1
#define DOUT10_INREG IN1
#endif
#define DIO57 57
#define DIO57_BIT DOUT10_BIT
#define DIO57_OUTREG DOUT10_OUTREG
#define DIO57_INREG DOUT10_INREG
#endif
#if (defined(DOUT11_BIT))
#define DOUT11 58
#if (DOUT11_BIT < 32)
#define DOUT11_OUTREG OUT0
#define DOUT11_INREG IN0
#else
#define DOUT11_OUTREG OUT1
#define DOUT11_INREG IN1
#endif
#define DIO58 58
#define DIO58_BIT DOUT11_BIT
#define DIO58_OUTREG DOUT11_OUTREG
#define DIO58_INREG DOUT11_INREG
#endif
#if (defined(DOUT12_BIT))
#define DOUT12 59
#if (DOUT12_BIT < 32)
#define DOUT12_OUTREG OUT0
#define DOUT12_INREG IN0
#else
#define DOUT12_OUTREG OUT1
#define DOUT12_INREG IN1
#endif
#define DIO59 59
#define DIO59_BIT DOUT12_BIT
#define DIO59_OUTREG DOUT12_OUTREG
#define DIO59_INREG DOUT12_INREG
#endif
#if (defined(DOUT13_BIT))
#define DOUT13 60
#if (DOUT13_BIT < 32)
#define DOUT13_OUTREG OUT0
#define DOUT13_INREG IN0
#else
#define DOUT13_OUTREG OUT1
#define DOUT13_INREG IN1
#endif
#define DIO60 60
#define DIO60_BIT DOUT13_BIT
#define DIO60_OUTREG DOUT13_OUTREG
#define DIO60_INREG DOUT13_INREG
#endif
#if (defined(DOUT14_BIT))
#define DOUT14 61
#if (DOUT14_BIT < 32)
#define DOUT14_OUTREG OUT0
#define DOUT14_INREG IN0
#else
#define DOUT14_OUTREG OUT1
#define DOUT14_INREG IN1
#endif
#define DIO61 61
#define DIO61_BIT DOUT14_BIT
#define DIO61_OUTREG DOUT14_OUTREG
#define DIO61_INREG DOUT14_INREG
#endif
#if (defined(DOUT15_BIT))
#define DOUT15 62
#if (DOUT15_BIT < 32)
#define DOUT15_OUTREG OUT0
#define DOUT15_INREG IN0
#else
#define DOUT15_OUTREG OUT1
#define DOUT15_INREG IN1
#endif
#define DIO62 62
#define DIO62_BIT DOUT15_BIT
#define DIO62_OUTREG DOUT15_OUTREG
#define DIO62_INREG DOUT15_INREG
#endif
#if (defined(DOUT16_BIT))
#define DOUT16 63
#if (DOUT16_BIT < 32)
#define DOUT16_OUTREG OUT0
#define DOUT16_INREG IN0
#else
#define DOUT16_OUTREG OUT1
#define DOUT16_INREG IN1
#endif
#define DIO63 63
#define DIO63_BIT DOUT16_BIT
#define DIO63_OUTREG DOUT16_OUTREG
#define DIO63_INREG DOUT16_INREG
#endif
#if (defined(DOUT17_BIT))
#define DOUT17 64
#if (DOUT17_BIT < 32)
#define DOUT17_OUTREG OUT0
#define DOUT17_INREG IN0
#else
#define DOUT17_OUTREG OUT1
#define DOUT17_INREG IN1
#endif
#define DIO64 64
#define DIO64_BIT DOUT17_BIT
#define DIO64_OUTREG DOUT17_OUTREG
