Paciente8159/uCNC/uCNC/src/hal/mcus/esp32c3/mcumap_esp32c3.h
#endif
#define DIO145 145
#define DIO145_BIT DIN15_BIT
#define DIO145_OUTREG DIN15_OUTREG
#define DIO145_INREG DIN15_INREG
#endif
#if (defined(DIN16_BIT))
#define DIN16 146
#if (DIN16_BIT < 32)
#define DIN16_OUTREG OUT0
#define DIN16_INREG IN0
#else
#define DIN16_OUTREG OUT1
#define DIN16_INREG IN1
#endif
#define DIO146 146
#define DIO146_BIT DIN16_BIT
#define DIO146_OUTREG DIN16_OUTREG
#define DIO146_INREG DIN16_INREG
#endif
#if (defined(DIN17_BIT))
#define DIN17 147
#if (DIN17_BIT < 32)
#define DIN17_OUTREG OUT0
#define DIN17_INREG IN0
#else
#define DIN17_OUTREG OUT1
#define DIN17_INREG IN1
#endif
#define DIO147 147
#define DIO147_BIT DIN17_BIT
#define DIO147_OUTREG DIN17_OUTREG
#define DIO147_INREG DIN17_INREG
#endif
#if (defined(DIN18_BIT))
#define DIN18 148
#if (DIN18_BIT < 32)
#define DIN18_OUTREG OUT0
#define DIN18_INREG IN0
#else
#define DIN18_OUTREG OUT1
#define DIN18_INREG IN1
#endif
#define DIO148 148
#define DIO148_BIT DIN18_BIT
#define DIO148_OUTREG DIN18_OUTREG
#define DIO148_INREG DIN18_INREG
#endif
#if (defined(DIN19_BIT))
#define DIN19 149
#if (DIN19_BIT < 32)
#define DIN19_OUTREG OUT0
#define DIN19_INREG IN0
#else
#define DIN19_OUTREG OUT1
#define DIN19_INREG IN1
#endif
#define DIO149 149
#define DIO149_BIT DIN19_BIT
#define DIO149_OUTREG DIN19_OUTREG
#define DIO149_INREG DIN19_INREG
#endif
#if (defined(DIN20_BIT))
#define DIN20 150
#if (DIN20_BIT < 32)
#define DIN20_OUTREG OUT0
#define DIN20_INREG IN0
#else
#define DIN20_OUTREG OUT1
#define DIN20_INREG IN1
#endif
#define DIO150 150
#define DIO150_BIT DIN20_BIT
#define DIO150_OUTREG DIN20_OUTREG
#define DIO150_INREG DIN20_INREG
#endif
#if (defined(DIN21_BIT))
#define DIN21 151
#if (DIN21_BIT < 32)
#define DIN21_OUTREG OUT0
#define DIN21_INREG IN0
#else
#define DIN21_OUTREG OUT1
#define DIN21_INREG IN1
#endif
#define DIO151 151
#define DIO151_BIT DIN21_BIT
#define DIO151_OUTREG DIN21_OUTREG
#define DIO151_INREG DIN21_INREG
#endif
#if (defined(DIN22_BIT))
#define DIN22 152
#if (DIN22_BIT < 32)
#define DIN22_OUTREG OUT0
#define DIN22_INREG IN0
#else
#define DIN22_OUTREG OUT1
#define DIN22_INREG IN1
#endif
#define DIO152 152
#define DIO152_BIT DIN22_BIT
#define DIO152_OUTREG DIN22_OUTREG
#define DIO152_INREG DIN22_INREG
#endif
#if (defined(DIN23_BIT))
#define DIN23 153
#if (DIN23_BIT < 32)
#define DIN23_OUTREG OUT0
#define DIN23_INREG IN0
#else
#define DIN23_OUTREG OUT1
#define DIN23_INREG IN1
#endif
#define DIO153 153
#define DIO153_BIT DIN23_BIT
#define DIO153_OUTREG DIN23_OUTREG
#define DIO153_INREG DIN23_INREG
#endif
#if (defined(DIN24_BIT))
#define DIN24 154
#if (DIN24_BIT < 32)
#define DIN24_OUTREG OUT0
#define DIN24_INREG IN0
#else
#define DIN24_OUTREG OUT1
#define DIN24_INREG IN1
#endif
#define DIO154 154
#define DIO154_BIT DIN24_BIT
#define DIO154_OUTREG DIN24_OUTREG
#define DIO154_INREG DIN24_INREG
#endif
#if (defined(DIN25_BIT))
#define DIN25 155
#if (DIN25_BIT < 32)
#define DIN25_OUTREG OUT0
#define DIN25_INREG IN0
#else
#define DIN25_OUTREG OUT1
#define DIN25_INREG IN1
#endif
#define DIO155 155
#define DIO155_BIT DIN25_BIT
#define DIO155_OUTREG DIN25_OUTREG
#define DIO155_INREG DIN25_INREG
#endif
#if (defined(DIN26_BIT))
#define DIN26 156
#if (DIN26_BIT < 32)
#define DIN26_OUTREG OUT0
#define DIN26_INREG IN0
#else
#define DIN26_OUTREG OUT1
#define DIN26_INREG IN1
#endif
#define DIO156 156
#define DIO156_BIT DIN26_BIT
#define DIO156_OUTREG DIN26_OUTREG
#define DIO156_INREG DIN26_INREG
#endif
#if (defined(DIN27_BIT))
#define DIN27 157
#if (DIN27_BIT < 32)
#define DIN27_OUTREG OUT0
#define DIN27_INREG IN0
#else
#define DIN27_OUTREG OUT1
#define DIN27_INREG IN1
#endif
#define DIO157 157
#define DIO157_BIT DIN27_BIT
#define DIO157_OUTREG DIN27_OUTREG
#define DIO157_INREG DIN27_INREG
#endif
#if (defined(DIN28_BIT))
#define DIN28 158
#if (DIN28_BIT < 32)
#define DIN28_OUTREG OUT0
#define DIN28_INREG IN0
#else
#define DIN28_OUTREG OUT1
#define DIN28_INREG IN1
#endif
#define DIO158 158
#define DIO158_BIT DIN28_BIT
#define DIO158_OUTREG DIN28_OUTREG
#define DIO158_INREG DIN28_INREG
#endif
#if (defined(DIN29_BIT))
#define DIN29 159
#if (DIN29_BIT < 32)
#define DIN29_OUTREG OUT0
#define DIN29_INREG IN0
#else
#define DIN29_OUTREG OUT1
#define DIN29_INREG IN1
#endif
#define DIO159 159
#define DIO159_BIT DIN29_BIT
#define DIO159_OUTREG DIN29_OUTREG
#define DIO159_INREG DIN29_INREG
#endif
#if (defined(DIN30_BIT))
#define DIN30 160
#if (DIN30_BIT < 32)
#define DIN30_OUTREG OUT0
#define DIN30_INREG IN0
#else
#define DIN30_OUTREG OUT1
#define DIN30_INREG IN1
#endif
#define DIO160 160
#define DIO160_BIT DIN30_BIT
#define DIO160_OUTREG DIN30_OUTREG
#define DIO160_INREG DIN30_INREG
#endif
#if (defined(DIN31_BIT))
#define DIN31 161
#if (DIN31_BIT < 32)
#define DIN31_OUTREG OUT0
#define DIN31_INREG IN0
#else
#define DIN31_OUTREG OUT1
#define DIN31_INREG IN1
#endif
#define DIO161 161
#define DIO161_BIT DIN31_BIT
#define DIO161_OUTREG DIN31_OUTREG
#define DIO161_INREG DIN31_INREG
#endif
#if (defined(DIN32_BIT))
#define DIN32 162
#if (DIN32_BIT < 32)
#define DIN32_OUTREG OUT0
#define DIN32_INREG IN0
#else
#define DIN32_OUTREG OUT1
#define DIN32_INREG IN1
#endif
#define DIO162 162
#define DIO162_BIT DIN32_BIT
#define DIO162_OUTREG DIN32_OUTREG
#define DIO162_INREG DIN32_INREG
#endif
#if (defined(DIN33_BIT))
#define DIN33 163
#if (DIN33_BIT < 32)
#define DIN33_OUTREG OUT0
#define DIN33_INREG IN0
#else
#define DIN33_OUTREG OUT1
#define DIN33_INREG IN1
#endif
#define DIO163 163
#define DIO163_BIT DIN33_BIT
#define DIO163_OUTREG DIN33_OUTREG
#define DIO163_INREG DIN33_INREG
#endif
#if (defined(DIN34_BIT))
#define DIN34 164
#if (DIN34_BIT < 32)
#define DIN34_OUTREG OUT0
#define DIN34_INREG IN0
#else
#define DIN34_OUTREG OUT1
#define DIN34_INREG IN1
#endif
#define DIO164 164
#define DIO164_BIT DIN34_BIT
#define DIO164_OUTREG DIN34_OUTREG
#define DIO164_INREG DIN34_INREG
#endif
#if (defined(DIN35_BIT))
#define DIN35 165
#if (DIN35_BIT < 32)
#define DIN35_OUTREG OUT0
#define DIN35_INREG IN0
#else
#define DIN35_OUTREG OUT1
#define DIN35_INREG IN1
#endif
#define DIO165 165
#define DIO165_BIT DIN35_BIT
#define DIO165_OUTREG DIN35_OUTREG
#define DIO165_INREG DIN35_INREG
#endif
#if (defined(DIN36_BIT))
#define DIN36 166
#if (DIN36_BIT < 32)
#define DIN36_OUTREG OUT0
#define DIN36_INREG IN0
#else
#define DIN36_OUTREG OUT1
#define DIN36_INREG IN1
#endif
#define DIO166 166
#define DIO166_BIT DIN36_BIT
#define DIO166_OUTREG DIN36_OUTREG
#define DIO166_INREG DIN36_INREG
#endif
#if (defined(DIN37_BIT))
#define DIN37 167
#if (DIN37_BIT < 32)
#define DIN37_OUTREG OUT0
#define DIN37_INREG IN0
#else
#define DIN37_OUTREG OUT1
#define DIN37_INREG IN1
#endif
#define DIO167 167
#define DIO167_BIT DIN37_BIT
#define DIO167_OUTREG DIN37_OUTREG
#define DIO167_INREG DIN37_INREG
#endif
#if (defined(DIN38_BIT))
#define DIN38 168
#if (DIN38_BIT < 32)
#define DIN38_OUTREG OUT0
#define DIN38_INREG IN0
#else
#define DIN38_OUTREG OUT1
#define DIN38_INREG IN1
#endif
#define DIO168 168
#define DIO168_BIT DIN38_BIT
#define DIO168_OUTREG DIN38_OUTREG
#define DIO168_INREG DIN38_INREG
#endif
#if (defined(DIN39_BIT))
#define DIN39 169
#if (DIN39_BIT < 32)
#define DIN39_OUTREG OUT0
#define DIN39_INREG IN0
#else
#define DIN39_OUTREG OUT1
#define DIN39_INREG IN1
#endif
#define DIO169 169
#define DIO169_BIT DIN39_BIT
#define DIO169_OUTREG DIN39_OUTREG
#define DIO169_INREG DIN39_INREG
#endif
#if (defined(DIN40_BIT))
#define DIN40 170
#if (DIN40_BIT < 32)
#define DIN40_OUTREG OUT0
#define DIN40_INREG IN0
#else
#define DIN40_OUTREG OUT1
#define DIN40_INREG IN1
#endif
#define DIO170 170
#define DIO170_BIT DIN40_BIT
#define DIO170_OUTREG DIN40_OUTREG
#define DIO170_INREG DIN40_INREG
#endif
#if (defined(DIN41_BIT))
#define DIN41 171
#if (DIN41_BIT < 32)
#define DIN41_OUTREG OUT0
#define DIN41_INREG IN0
#else
#define DIN41_OUTREG OUT1
#define DIN41_INREG IN1
#endif
#define DIO171 171
#define DIO171_BIT DIN41_BIT
#define DIO171_OUTREG DIN41_OUTREG
#define DIO171_INREG DIN41_INREG
#endif
#if (defined(DIN42_BIT))
#define DIN42 172
#if (DIN42_BIT < 32)
#define DIN42_OUTREG OUT0
#define DIN42_INREG IN0
#else
#define DIN42_OUTREG OUT1
#define DIN42_INREG IN1
#endif
#define DIO172 172
#define DIO172_BIT DIN42_BIT
#define DIO172_OUTREG DIN42_OUTREG
#define DIO172_INREG DIN42_INREG
#endif
#if (defined(DIN43_BIT))
#define DIN43 173
#if (DIN43_BIT < 32)
#define DIN43_OUTREG OUT0
#define DIN43_INREG IN0
#else
#define DIN43_OUTREG OUT1
#define DIN43_INREG IN1
#endif
#define DIO173 173
#define DIO173_BIT DIN43_BIT
#define DIO173_OUTREG DIN43_OUTREG
#define DIO173_INREG DIN43_INREG
#endif
#if (defined(DIN44_BIT))
#define DIN44 174
#if (DIN44_BIT < 32)
#define DIN44_OUTREG OUT0
#define DIN44_INREG IN0
#else
#define DIN44_OUTREG OUT1
#define DIN44_INREG IN1
#endif
#define DIO174 174
#define DIO174_BIT DIN44_BIT
#define DIO174_OUTREG DIN44_OUTREG
#define DIO174_INREG DIN44_INREG
#endif
#if (defined(DIN45_BIT))
#define DIN45 175
#if (DIN45_BIT < 32)
#define DIN45_OUTREG OUT0
#define DIN45_INREG IN0
#else
#define DIN45_OUTREG OUT1
#define DIN45_INREG IN1
#endif
#define DIO175 175
#define DIO175_BIT DIN45_BIT
#define DIO175_OUTREG DIN45_OUTREG
#define DIO175_INREG DIN45_INREG
#endif
#if (defined(DIN46_BIT))
#define DIN46 176
#if (DIN46_BIT < 32)
#define DIN46_OUTREG OUT0
#define DIN46_INREG IN0
#else
#define DIN46_OUTREG OUT1
#define DIN46_INREG IN1
#endif
#define DIO176 176
#define DIO176_BIT DIN46_BIT
#define DIO176_OUTREG DIN46_OUTREG
#define DIO176_INREG DIN46_INREG
#endif
#if (defined(DIN47_BIT))
#define DIN47 177
#if (DIN47_BIT < 32)
#define DIN47_OUTREG OUT0
#define DIN47_INREG IN0
#else
#define DIN47_OUTREG OUT1
#define DIN47_INREG IN1
#endif
#define DIO177 177
#define DIO177_BIT DIN47_BIT
#define DIO177_OUTREG DIN47_OUTREG
#define DIO177_INREG DIN47_INREG
#endif
#if (defined(DIN48_BIT))
#define DIN48 178
#if (DIN48_BIT < 32)
#define DIN48_OUTREG OUT0
#define DIN48_INREG IN0
#else
#define DIN48_OUTREG OUT1
#define DIN48_INREG IN1
#endif
#define DIO178 178
#define DIO178_BIT DIN48_BIT
#define DIO178_OUTREG DIN48_OUTREG
#define DIO178_INREG DIN48_INREG
#endif
#if (defined(DIN49_BIT))
#define DIN49 179
#if (DIN49_BIT < 32)
#define DIN49_OUTREG OUT0
#define DIN49_INREG IN0
#else
#define DIN49_OUTREG OUT1
#define DIN49_INREG IN1
#endif
#define DIO179 179
#define DIO179_BIT DIN49_BIT
#define DIO179_OUTREG DIN49_OUTREG
#define DIO179_INREG DIN49_INREG
#endif
#if (defined(TX_BIT))
#define TX 200
#if (TX_BIT < 32)
#define TX_OUTREG OUT0
#define TX_INREG IN0
#else
#define TX_OUTREG OUT1
#define TX_INREG IN1
#endif
#define DIO200 200
#define DIO200_BIT TX_BIT
#define DIO200_OUTREG TX_OUTREG
#define DIO200_INREG TX_INREG
#endif
#if (defined(RX_BIT))
#define RX 201
#if (RX_BIT < 32)
#define RX_OUTREG OUT0
#define RX_INREG IN0
#else
#define RX_OUTREG OUT1
#define RX_INREG IN1
#endif
#define DIO201 201
#define DIO201_BIT RX_BIT
#define DIO201_OUTREG RX_OUTREG
#define DIO201_INREG RX_INREG
#endif
#if (defined(USB_DM_BIT))
#define USB_DM 202
#if (USB_DM_BIT < 32)
#define USB_DM_OUTREG OUT0
#define USB_DM_INREG IN0
#else
#define USB_DM_OUTREG OUT1
#define USB_DM_INREG IN1
#endif
#define DIO202 202
#define DIO202_BIT USB_DM_BIT
#define DIO202_OUTREG USB_DM_OUTREG
#define DIO202_INREG USB_DM_INREG
#endif
#if (defined(USB_DP_BIT))
#define USB_DP 203
#if (USB_DP_BIT < 32)
#define USB_DP_OUTREG OUT0
#define USB_DP_INREG IN0
#else
#define USB_DP_OUTREG OUT1
#define USB_DP_INREG IN1
#endif
#define DIO203 203
#define DIO203_BIT USB_DP_BIT
#define DIO203_OUTREG USB_DP_OUTREG
#define DIO203_INREG USB_DP_INREG
#endif
#if (defined(SPI_CLK_BIT))
#define SPI_CLK 204
#if (SPI_CLK_BIT < 32)
#define SPI_CLK_OUTREG OUT0
#define SPI_CLK_INREG IN0
#else
#define SPI_CLK_OUTREG OUT1
#define SPI_CLK_INREG IN1
#endif
#define DIO204 204
#define DIO204_BIT SPI_CLK_BIT
#define DIO204_OUTREG SPI_CLK_OUTREG
#define DIO204_INREG SPI_CLK_INREG
#endif
#if (defined(SPI_SDI_BIT))
#define SPI_SDI 205
#if (SPI_SDI_BIT < 32)
#define SPI_SDI_OUTREG OUT0
#define SPI_SDI_INREG IN0
#else
#define SPI_SDI_OUTREG OUT1
#define SPI_SDI_INREG IN1
#endif
#define DIO205 205
#define DIO205_BIT SPI_SDI_BIT
#define DIO205_OUTREG SPI_SDI_OUTREG
#define DIO205_INREG SPI_SDI_INREG
#endif
#if (defined(SPI_SDO_BIT))
#define SPI_SDO 206
#if (SPI_SDO_BIT < 32)
#define SPI_SDO_OUTREG OUT0
#define SPI_SDO_INREG IN0
#else
#define SPI_SDO_OUTREG OUT1
#define SPI_SDO_INREG IN1
#endif
#define DIO206 206
#define DIO206_BIT SPI_SDO_BIT
#define DIO206_OUTREG SPI_SDO_OUTREG
#define DIO206_INREG SPI_SDO_INREG
#endif
#if (defined(SPI_CS_BIT))
#define SPI_CS 207
#if (SPI_CS_BIT < 32)
#define SPI_CS_OUTREG OUT0
#define SPI_CS_INREG IN0
#else
#define SPI_CS_OUTREG OUT1
#define SPI_CS_INREG IN1
#endif
#define DIO207 207
#define DIO207_BIT SPI_CS_BIT
#define DIO207_OUTREG SPI_CS_OUTREG
#define DIO207_INREG SPI_CS_INREG
#endif
#if (defined(I2C_CLK_BIT))
#define I2C_CLK 208
#if (I2C_CLK_BIT < 32)
#define I2C_CLK_OUTREG OUT0
#define I2C_CLK_INREG IN0
#else
#define I2C_CLK_OUTREG OUT1
#define I2C_CLK_INREG IN1
#endif
#define DIO208 208
#define DIO208_BIT I2C_CLK_BIT
#define DIO208_OUTREG I2C_CLK_OUTREG
#define DIO208_INREG I2C_CLK_INREG
#endif
#if (defined(I2C_DATA_BIT))
#define I2C_DATA 209
#if (I2C_DATA_BIT < 32)
#define I2C_DATA_OUTREG OUT0
#define I2C_DATA_INREG IN0
#else
#define I2C_DATA_OUTREG OUT1
#define I2C_DATA_INREG IN1
#endif
#define DIO209 209
#define DIO209_BIT I2C_DATA_BIT
#define DIO209_OUTREG I2C_DATA_OUTREG
#define DIO209_INREG I2C_DATA_INREG
#endif
#if (defined(TX2_BIT))
#define TX2 210
#if (TX2_BIT < 32)
#define TX2_OUTREG OUT0
#define TX2_INREG IN0
#else
#define TX2_OUTREG OUT1
#define TX2_INREG IN1
#endif
#define DIO210 210
#define DIO210_BIT TX2_BIT
#define DIO210_OUTREG TX2_OUTREG
#define DIO210_INREG TX2_INREG
#endif
#if (defined(RX2_BIT))
#define RX2 211
#if (RX2_BIT < 32)
#define RX2_OUTREG OUT0
#define RX2_INREG IN0
#else
#define RX2_OUTREG OUT1
#define RX2_INREG IN1
#endif
#define DIO211 211
#define DIO211_BIT RX2_BIT
#define DIO211_OUTREG RX2_OUTREG
#define DIO211_INREG RX2_INREG
#endif
#if (defined(SPI2_CLK_BIT))
#define SPI2_CLK 212
#if (SPI2_CLK_BIT < 32)
#define SPI2_CLK_OUTREG OUT0
#define SPI2_CLK_INREG IN0
#else
#define SPI2_CLK_OUTREG OUT1
#define SPI2_CLK_INREG IN1
#endif
#define DIO212 212
#define DIO212_BIT SPI2_CLK_BIT
#define DIO212_OUTREG SPI2_CLK_OUTREG
#define DIO212_INREG SPI2_CLK_INREG
#endif
#if (defined(SPI2_SDI_BIT))
#define SPI2_SDI 213
#if (SPI2_SDI_BIT < 32)
#define SPI2_SDI_OUTREG OUT0
#define SPI2_SDI_INREG IN0
#else
#define SPI2_SDI_OUTREG OUT1
#define SPI2_SDI_INREG IN1
#endif
#define DIO213 213
#define DIO213_BIT SPI2_SDI_BIT
#define DIO213_OUTREG SPI2_SDI_OUTREG
#define DIO213_INREG SPI2_SDI_INREG
#endif
#if (defined(SPI2_SDO_BIT))
#define SPI2_SDO 214
#if (SPI2_SDO_BIT < 32)
#define SPI2_SDO_OUTREG OUT0
#define SPI2_SDO_INREG IN0
#else
#define SPI2_SDO_OUTREG OUT1
#define SPI2_SDO_INREG IN1
#endif
#define DIO214 214
#define DIO214_BIT SPI2_SDO_BIT
#define DIO214_OUTREG SPI2_SDO_OUTREG
#define DIO214_INREG SPI2_SDO_INREG
#endif
#if (defined(SPI2_CS_BIT))
#define SPI2_CS 215
#if (SPI2_CS_BIT < 32)
#define SPI2_CS_OUTREG OUT0
#define SPI2_CS_INREG IN0
#else
#define SPI2_CS_OUTREG OUT1
#define SPI2_CS_INREG IN1
#endif
#define DIO215 215
#define DIO215_BIT SPI2_CS_BIT
#define DIO215_OUTREG SPI2_CS_OUTREG
#define DIO215_INREG SPI2_CS_INREG
#endif

// ISR on change inputs
#if (defined(LIMIT_X_ISR) && defined(LIMIT_X))
#define DIO100_ISR (LIMIT_X_ISR)
#define LIMIT_X_ISRVAR 1
#define DIO100_ISRVAR 1
#endif
#if (defined(LIMIT_Y_ISR) && defined(LIMIT_Y))
#define DIO101_ISR (LIMIT_Y_ISR)
#define LIMIT_Y_ISRVAR 1
#define DIO101_ISRVAR 1
#endif
#if (defined(LIMIT_Z_ISR) && defined(LIMIT_Z))
#define DIO102_ISR (LIMIT_Z_ISR)
#define LIMIT_Z_ISRVAR 1
#define DIO102_ISRVAR 1
#endif
#if (defined(LIMIT_X2_ISR) && defined(LIMIT_X2))
#define DIO103_ISR (LIMIT_X2_ISR)
#define LIMIT_X2_ISRVAR 1
#define DIO103_ISRVAR 1
#endif
#if (defined(LIMIT_Y2_ISR) && defined(LIMIT_Y2))
#define DIO104_ISR (LIMIT_Y2_ISR)
#define LIMIT_Y2_ISRVAR 1
#define DIO104_ISRVAR 1
#endif
#if (defined(LIMIT_Z2_ISR) && defined(LIMIT_Z2))
#define DIO105_ISR (LIMIT_Z2_ISR)
#define LIMIT_Z2_ISRVAR 1
#define DIO105_ISRVAR 1
#endif
#if (defined(LIMIT_A_ISR) && defined(LIMIT_A))
#define DIO106_ISR (LIMIT_A_ISR)
#define LIMIT_A_ISRVAR 1
#define DIO106_ISRVAR 1
#endif
#if (defined(LIMIT_B_ISR) && defined(LIMIT_B))
#define DIO107_ISR (LIMIT_B_ISR)
#define LIMIT_B_ISRVAR 1
#define DIO107_ISRVAR 1
#endif
#if (defined(LIMIT_C_ISR) && defined(LIMIT_C))
#define DIO108_ISR (LIMIT_C_ISR)
#define LIMIT_C_ISRVAR 1
#define DIO108_ISRVAR 1
#endif
#if (defined(PROBE_ISR) && defined(PROBE))
#define DIO109_ISR (PROBE_ISR)
#define PROBE_ISRVAR 2
#define DIO109_ISRVAR 2
#endif
#if (defined(ESTOP_ISR) && defined(ESTOP))
#define DIO110_ISR (ESTOP_ISR)
#define ESTOP_ISRVAR 0
#define DIO110_ISRVAR 0
#endif
#if (defined(SAFETY_DOOR_ISR) && defined(SAFETY_DOOR))
#define DIO111_ISR (SAFETY_DOOR_ISR)
#define SAFETY_DOOR_ISRVAR 0
#define DIO111_ISRVAR 0
#endif
#if (defined(FHOLD_ISR) && defined(FHOLD))
#define DIO112_ISR (FHOLD_ISR)
#define FHOLD_ISRVAR 0
#define DIO112_ISRVAR 0
#endif
#if (defined(CS_RES_ISR) && defined(CS_RES))
#define DIO113_ISR (CS_RES_ISR)
#define CS_RES_ISRVAR 0
#define DIO113_ISRVAR 0
#endif
#if (defined(DIN0_ISR) && defined(DIN0))
#define DIO130_ISR (DIN0_ISR)
#define DIN0_ISRVAR 3
#define DIO130_ISRVAR 3
#endif
#if (defined(DIN1_ISR) && defined(DIN1))
#define DIO131_ISR (DIN1_ISR)
#define DIN1_ISRVAR 3
#define DIO131_ISRVAR 3
#endif
#if (defined(DIN2_ISR) && defined(DIN2))
#define DIO132_ISR (DIN2_ISR)
#define DIN2_ISRVAR 3
#define DIO132_ISRVAR 3
#endif
#if (defined(DIN3_ISR) && defined(DIN3))
#define DIO133_ISR (DIN3_ISR)
#define DIN3_ISRVAR 3
#define DIO133_ISRVAR 3
#endif
#if (defined(DIN4_ISR) && defined(DIN4))
#define DIO134_ISR (DIN4_ISR)
#define DIN4_ISRVAR 3
#define DIO134_ISRVAR 3
#endif
#if (defined(DIN5_ISR) && defined(DIN5))
#define DIO135_ISR (DIN5_ISR)
#define DIN5_ISRVAR 3
#define DIO135_ISRVAR 3
#endif
#if (defined(DIN6_ISR) && defined(DIN6))
#define DIO136_ISR (DIN6_ISR)
#define DIN6_ISRVAR 3
#define DIO136_ISRVAR 3
#endif
#if (defined(DIN7_ISR) && defined(DIN7))
#define DIO137_ISR (DIN7_ISR)
#define DIN7_ISRVAR 3
#define DIO137_ISRVAR 3
#endif

#define __adc_channel_helper__(X, Y) ADC##X##_CHANNEL_##Y
#define _adc_channel_helper_(X, Y) __adc_channel_helper__(X, Y)

#ifdef ANALOG0
#define ANALOG0_ADC_CHANNEL _adc_channel_helper_(ANALOG0_CHANNEL, ANALOG0_ADC)
#define DIO114_CHANNEL ANALOG0_CHANNEL
#define DIO114_ADC ANALOG0_ADC
#define DIO114_ADC_CHANNEL ANALOG0_ADC_CHANNEL
#endif
#ifdef ANALOG1
#define ANALOG1_ADC_CHANNEL _adc_channel_helper_(ANALOG1_CHANNEL, ANALOG1_ADC)
#define DIO115_CHANNEL ANALOG1_CHANNEL
#define DIO115_ADC ANALOG1_ADC
#define DIO115_ADC_CHANNEL ANALOG1_ADC_CHANNEL
#endif
#ifdef ANALOG2
#define ANALOG2_ADC_CHANNEL _adc_channel_helper_(ANALOG2_CHANNEL, ANALOG2_ADC)
#define DIO116_CHANNEL ANALOG2_CHANNEL
#define DIO116_ADC ANALOG2_ADC
#define DIO116_ADC_CHANNEL ANALOG2_ADC_CHANNEL
#endif
#ifdef ANALOG3
#define ANALOG3_ADC_CHANNEL _adc_channel_helper_(ANALOG3_CHANNEL, ANALOG3_ADC)
#define DIO117_CHANNEL ANALOG3_CHANNEL
#define DIO117_ADC ANALOG3_ADC
#define DIO117_ADC_CHANNEL ANALOG3_ADC_CHANNEL
#endif
#ifdef ANALOG4
#define ANALOG4_ADC_CHANNEL _adc_channel_helper_(ANALOG4_CHANNEL, ANALOG4_ADC)
#define DIO118_CHANNEL ANALOG4_CHANNEL
#define DIO118_ADC ANALOG4_ADC
#define DIO118_ADC_CHANNEL ANALOG4_ADC_CHANNEL
#endif
#ifdef ANALOG5
#define ANALOG5_ADC_CHANNEL _adc_channel_helper_(ANALOG5_CHANNEL, ANALOG5_ADC)
#define DIO119_CHANNEL ANALOG5_CHANNEL
#define DIO119_ADC ANALOG5_ADC
#define DIO119_ADC_CHANNEL ANALOG5_ADC_CHANNEL
#endif
#ifdef ANALOG6
#define ANALOG6_ADC_CHANNEL _adc_channel_helper_(ANALOG6_CHANNEL, ANALOG6_ADC)
#define DIO120_CHANNEL ANALOG6_CHANNEL
#define DIO120_ADC ANALOG6_ADC
#define DIO120_ADC_CHANNEL ANALOG6_ADC_CHANNEL
#endif
#ifdef ANALOG7
#define ANALOG7_ADC_CHANNEL _adc_channel_helper_(ANALOG7_CHANNEL, ANALOG7_ADC)
#define DIO121_CHANNEL ANALOG7_CHANNEL
#define DIO121_ADC ANALOG7_ADC
#define DIO121_ADC_CHANNEL ANALOG7_ADC_CHANNEL
#endif
#ifdef ANALOG8
#define ANALOG8_ADC_CHANNEL _adc_channel_helper_(ANALOG8_CHANNEL, ANALOG8_ADC)
#define DIO122_CHANNEL ANALOG8_CHANNEL
#define DIO122_ADC ANALOG8_ADC
#define DIO122_ADC_CHANNEL ANALOG8_ADC_CHANNEL
#endif
#ifdef ANALOG9
#define ANALOG9_ADC_CHANNEL _adc_channel_helper_(ANALOG9_CHANNEL, ANALOG9_ADC)
#define DIO123_CHANNEL ANALOG9_CHANNEL
#define DIO123_ADC ANALOG9_ADC
#define DIO123_ADC_CHANNEL ANALOG9_ADC_CHANNEL
#endif
#ifdef ANALOG10
#define ANALOG10_ADC_CHANNEL                                                   \
  _adc_channel_helper_(ANALOG10_CHANNEL, ANALOG10_ADC)
#define DIO124_CHANNEL ANALOG10_CHANNEL
#define DIO124_ADC ANALOG10_ADC
#define DIO124_ADC_CHANNEL ANALOG10_ADC_CHANNEL
#endif
#ifdef ANALOG11
#define ANALOG11_ADC_CHANNEL                                                   \
  _adc_channel_helper_(ANALOG11_CHANNEL, ANALOG11_ADC)
#define DIO125_CHANNEL ANALOG11_CHANNEL
#define DIO125_ADC ANALOG11_ADC
#define DIO125_ADC_CHANNEL ANALOG11_ADC_CHANNEL
#endif
#ifdef ANALOG12
#define ANALOG12_ADC_CHANNEL                                                   \
  _adc_channel_helper_(ANALOG12_CHANNEL, ANALOG12_ADC)
#define DIO126_CHANNEL ANALOG12_CHANNEL
#define DIO126_ADC ANALOG12_ADC
#define DIO126_ADC_CHANNEL ANALOG12_ADC_CHANNEL
#endif
#ifdef ANALOG13
#define ANALOG13_ADC_CHANNEL                                                   \
  _adc_channel_helper_(ANALOG13_CHANNEL, ANALOG13_ADC)
#define DIO127_CHANNEL ANALOG13_CHANNEL
#define DIO127_ADC ANALOG13_ADC
#define DIO127_ADC_CHANNEL ANALOG13_ADC_CHANNEL
#endif
#ifdef ANALOG14
#define ANALOG14_ADC_CHANNEL                                                   \
  _adc_channel_helper_(ANALOG14_CHANNEL, ANALOG14_ADC)
#define DIO128_CHANNEL ANALOG14_CHANNEL
#define DIO128_ADC ANALOG14_ADC
#define DIO128_ADC_CHANNEL ANALOG14_ADC_CHANNEL
#endif
#ifdef ANALOG15
#define ANALOG15_ADC_CHANNEL                                                   \
  _adc_channel_helper_(ANALOG15_CHANNEL, ANALOG15_ADC)
#define DIO129_CHANNEL ANALOG15_CHANNEL
#define DIO129_ADC ANALOG15_ADC
#define DIO129_ADC_CHANNEL ANALOG15_ADC_CHANNEL
#endif

/*PWM's*/

